{
	"page": {
		"page-head": {
			"page-title": "Model Rocket",
			"date": "January 8, 2021"
		},
		"block": [
			{
				"title": "Overview",
				"text": "I was getting into 3D printing, and had just bought myself a Ender 3 Pro. This was really fun to make! I 3D printed the whole thing, and recently launched it. Stay tuned for part two, including a parachute."
			},
			{
				"image":"rocket.png"
			},
			{
				"title": "Videos",
				"text": "Here are some videos of the rocket in action!",
				"video": [
					"launch2.mp4"
				]
			},
			{
				"title": "Materials",
				"text": "This was designed and 3D printed, so the whole of the rocket is made of PLA plastic. I printed part of it at school (shoutout to Mr. Cox for letting me use the school printer) and the rest at home in three different parts, and attatched them all. One thing to note is that this first design does not include a parachute, so it did just fall from the sky :). I used a makeshift launchstand, which was two 2x4s attatched with one screw, and used some hockey tape to attatch a 'launch rod' that I got from Home Depot."
			},
			{
				"title": "Engines",
				"text": "The engines were C6-3 engines that I got from the Canadian Rocket Store. This was actually very interesting, as since I designed the rocket to be 3 seperate parts, after the delay it blew up. For those who aren't aware, the rocket engines have a delay on them, these engines 3 seconds, and after the delay it shoots gas into the top of the rocket, pressurizing it and causing the top to pop off. This is meant for parachute deploy on time, but this ended up just exploding the rocket into a few peices. I kind of expected it, but it was funny to see it blast apart in a puff of smoke."
			},
			{
				"title": "Physics",
				"text": "So I did some quick calculations with my grade 11 physics knowledge, just to find its probable apogee and velocity. Here is what I came across:",
				"iframe": "<iframe frameBorder=\"0\" width=\"800px\" height=\"100%\" style=\"min-width: 400px; min-height:400px\" src=\"https://www.mathcha.io/editor/10JLmhV1HvqhW4gK9ocX6QK9xFv7LzVvHJJmLG5?embedded=true\"></iframe>"
			},
			{
				"iframe": "<iframe src=\"https://www.desmos.com/calculator/wpvjgrsnpr?embed\" width=\"500px\" height=\"500px\" style=\"border: 1px solid #ccc\" frameborder=0></iframe>"
			},
			{
				"title": "Electronics",
				"text": "I also had to work up some sketchy electronics to get the igniter to go, here's the layout:"
			},
			{
				"image": "circuit.png"
			},
			{
				"title": "Renders"
			},
			{
				"render": "main.png"
			},
			{
				"title": "Downloads",
				"ul": [
					{
						"href": "https://github.com/owenmoogk/model-rocket",
						"text": "CAD / Files"
					}
				]
			}
		]
	}
}