{
	"page": {
		"page-head": {
			"page-title": "2702 Rebels 2019 Robot",
			"date": "May 5, 2019"
		},
		"block": [
			{
				"title": "Overview",
				"text": [
					"I am a part of the",
					{
						"href": "https://2702rebels.com",
						"text": "2702 Rebels"
					},
					"FIRST Robotics team, and we just finished our 2019 robot, named Roadrunner! It was designed to compete in the",
					{
						"href": "https://www.youtube.com/watch?v=Mew6G_og-PI",
						"text": "2019 Destination Deep Space"
					},
					"FIRST robotics competition. This page takes an in depth look into our robot, with some of the specs and competition numbers. Overall, I am super proud of this robot, as we qualified for the Detroit World Championships! Check it out in action in our",
					{
						"href": "https://www.youtube.com/watch?v=Qg6R_3o6a9M",
						"text": "reveal video"
					},
					"(which is also linked at the bottom)."
				],
				"image": "robot.png"
			},
			{
				"title": "Competition",
				"text": "During the 2019 season, our robot competed in 6 competitions, winning 3 awards. Our robot was 46-35-0 (win-loss-tie), and qualified to the Detroit World Championships, in which we were semi-finalists.",
				"image": "competition.png"
			},
			{
				"title": "Intake",
				"text": "This intake on our robot was designed to be robust, and pick up balls from many directions. It has two guiding bars, and a limit switch on a crash bar to detect when a ball enters the system. It also doubled as part of our climb, as the two wheels you can see on the bottom reached up to the habitat zone and propelled the robot forward. The intake is an ABS roller run by a 775 motor attatched to a Versa Planetary Gearbox, and the whole mechanism is deployed using two Mini-CIMs.",
				"image": "intake.png"
			},
			{
				"title": "Shooter",
				"text": "The shooter on our robot is mounted to the elevator, and is also propelled by a 775 Pro. It has an ABS outtake roller, and a plastic guide on the top. When a basll is handed off into the system, a limit switch is tripper to prevent the ball from leaving out the shooter right away. This is how we can tell if we have a ball or not. This shooter is mounted to the elevator giving us ablilty to deploy a ball on all three levels of the rocketship.",
				"image": "shooter.png"
			},
			{
				"title": "Hatch Gripper",
				"text": "The hatch gripper was a part of the robot designed to both pickup and deploy the hatches on the field. It is almost entirely 3D printed, and is mounted on 4 bars of aluminum. It is both deployed and actuated by pneumatics, and has a limit switch behind a peice of Lexan to detect when a hatch is ready to be picked up. It is also mounted to the elevator, meaning it can reach all three levels of the rocketship.",
				"image": "hatch.png"
			},
			{
				"title": "Drivetrain",
				"text": "Lastly, the drivetrain of the robot is manufactured out of steel, and was welded together. It has six 6 SmoothGrip wheels in a tank drive formation, and is powered by four CIM motors, two on each side.",
				"image": "drive.png"
			},
			{
				"title": "Downloads",
				"ul": [
					{
						"href": "https://github.com/owenmoogk/renders/tree/master/2019robot/img",
						"text": "Renders"
					},
					{
						"href": "https://2702rebels.com/resource/resource-2019/",
						"text": "Robot Code"
					}
				]
			},
			{
				"title": "Resources",
				"ul": [
					{
						"href": "https://2702rebels.com",
						"text": "2702 Rebels"
					},
					{
						"href": "https://firstinspires.org",
						"text": "FIRST"
					},
					{
						"href": "https://thebluealliance.com",
						"text": "The Blue Alliance"
					}
				]
			}
			
		]
	}
}