{
	"page": {
		"page-head": {
			"page-title": "2702 Rebels 2020 Robot",
			"date": "March 24, 2020"
		},
		"block": [
			{
				"title": "Overview",
				"text": [
					"I am a part of the",
					{
						"href": "https://2702rebels.com",
						"text": "2702 Rebels"
					},
					"FIRST Robotics team, and we just finished our 2020 robot, designed to compete in the",
					{
						"href":"https://www.youtube.com/watch?v=gmiYWTmFRVE",
						"text": "2020 Infinite Recharge"
					},
					"robotics competition. This page goes in depth into our robot, with some of the specs. I was the lead student on the feeder subsystem, and also worked on the intake. Check it out in action in our",
					{
						"href": "https://www.youtube.com/watch?v=tN_Rt3pt054",
						"text": "reveal video"
					},
					". Unfortunatley, due to COVID-19, this robot has not been able to compete yet."
				],
				"image": "robot.png"
			},
			{
				"title": "Competition",
				"text": "Cancelled due to COVID-19."
			},
			{
				"title": "Intake",
				"text": "This intake on our robot was designed to both pickup the balls, and center them in a specific location to handoff to the feeder. It is made up of three shafts, an ABS roller, a vectored intake roller made up of 3D printed mecanum wheels, and a shaft with two wheels to handoff into the feeder. All three are driven by a 775 Pro attatched to a Versa Planetary gearbox. The intake is deployed by two 6\" pneumatic pistons.",
				"image": "intake.png"
			},
			{
				"title": "Feeder",
				"text": "The feeder was designed with the sole intention of getting the balls from the intake to the shooter. It is made up of 3D printer rollers and spacers running polycord between the shafts. It is run off of four RS550 motors.",
				"image": "feed.png"
			},
			{
				"title": "Shooter",
				"text": "The shooter on our robot is based upon two 6\" flywheels spinning to propel the ball. The flywheels are powered by a Falcon 500. The hood over the flywheels guides the balls, and can change its angle based on the distance of the target. It is attatched to a worm gear powered by an AM-2235 Snowblower motor. The entire shooter is mounted on a turret that can pivot 270°, powered by a 775 Pro motor.",
				"image": "shooter.png"
			},
			{
				"title": "Climber/Control Panel",
				"text": "The climber arm is designed to ascend the robot onto the endgame hang bar. It has a hook at the top, and is powered by two 775 Pro motors. It also doubles as our control panel mechanism, as it has two compliant wheels mounted on it. The mechanism is deployed using a pneumatic cylinder.",
				"image": "climb.png"
			},
			{
				"title": "Drivetrain",
				"text": "Lastly, the drivetrain of the robot is manufactured out of aluminum, and was welded together. It has six 6\" SmoothGrip wheels in a tank drive formation, and is powered by four NEO motors, two on each side.",
				"image": "drive.png"
			},
			{
				"title": "Downloads",
				"ul": [
					{
						"text": "Renders",
						"href": "https://github.com/owenmoogk/renders/tree/master/2020robot/img"
					}
				]
			},
			{
				"title": "Resources",
				"ul": [
					{
						"text": "2702 Rebels",
						"href": "https://2702rebels.com"
					},
					{
						"text": "FIRST",
						"href": "https://www.firstinspires.org/"
					},
					{
						"text": "The Blue Alliance",
						"href": "https://www.thebluealliance.com/"
					}
				]
			}
		]
	}
}